// 1. regExp
// let regExp = / hello /; - includes word 'hello'
// let regExp = / ^hello /; - starts with word 'hello'
// let regExp = / hello$ /; - ends with word 'hello'
// let regExp = / ^hello$ /; - exactly word 'hello'


// 2. Діапазони:

// /[a-z]/.test('a')
// /[A-Z]/.test('A')
// /[0-9]/.test('0')
// /[A-Za-z0-9]/.test('')

// Інверсія діапазону:
// /^[a-z]/.test('a')
// /^[A-Z]/.test('A')
// /^[0-9]/.test('0')
// /^[A-Za-z0-9]/.test('')


// 3. Метасимволи:

// \d збігається з будь-яким числом, еквівалентно [0-9]
// \D збігається з будь-яким символом, який не є числом, еквівалентно [^0-9]
// \w збігається з будь-яким буквено-числовим символом, еквівалентно [A-Za-z0-9]
// \W збігається з будь-яким символом, який не є буквено-числовим значенням, еквівалентно [^A-Za-z0-9]
// \s збігається з будь-яким пробільним символом: пробіл, табуляція, символ нового рядка і пробіли Unicode
// \S збігається з будь-яким символом, який не є пробілом
// \0 збігається з null
// \n збігається з символом нового рядка
// \t збігається з символом табуляції
// \uXXXX збігається з символом Unicode з кодом XXXX (потрібно прапор u)
// . збігається з будь-яким символовом, крім символу нового рядка (таким як \n)
// [^] Збігається з будь-яким символом, включаючи символ нового рядка. Корисно при роботі з багаторядковими рядками


// 4. Others

// /^\d$/                   - 1 цифра
// /^\d?$/                  - 0-1 раз
// /^\d+$/.test('12')       - 1+ раз
// /^\d*$/.test('12')       - 0+ раз
// /^\d{n}$/.test('123')    - n раз
// /^\d{n,m}$/.test('123')  - від n до m раз / m може бути пустим, тоді від n раз
// /^\d{n}\w?$/.test('123') - робить опціональним слово після тексту



// 5. Екранування
// Спеціальні символи:
//     \
//     /
//     [ ]
//     ( )
//     { }
//     ?
//     +
//     *
//     |
//     .
//     ^
//     $

// /^\$$/ - збіг з знаком "$"


// /(?=.*[A-Z])(?=.*[a-z])/.test('') - must contain lower and capital letters